let msgs = [
  '才{}次就无力啦？建议直接投降保尊严啦~',
  '才{}次就手腕就发酸？杂鱼是泡芙做的吗~',
  '才{}次就开始喘气咯？隔壁老奶奶都比你有耐力啦~',
  '{}次就喊暂停？杂鱼计时器坏掉了吧~',
  '才{}次额头冒汗？这点运动量连仓鼠轮都转不满~',
  '这才{}次开始求饶？杂鱼语音包是复读"投降"吗~',
  '才{}次就眼神无神啦？需要帮你呼叫殡仪馆热线吗~',
  '{}次就手不稳打翻水杯？哎呀~桌面比你有干劲呢~',
  '{}次进入贤者模式啦？杂鱼の思考回路只有单线程吗~',
  '这就按捺不住了？建议把双手捐给需要的人呢~',
  '手腕晃得像果冻？杂鱼の稳定性还不如超市推车~',
  '眼神开始模仿死鱼？需要借你眼药水吗~（晃空瓶）',
  '说好的‘最后一次’呢？杂鱼的承诺像泡面保质期一样虚假~',
  '桌面比你有出息哦~~~~~~~~~~~~~至少能撑住键盘不发抖啦~',
  '呜哇~这喘息声录下来能当ASMR素材卖呢~（假装录音）',
  '手指蜷缩的样子...是在模仿煮熟的小龙虾吗~',
  '灵魂快要从嘴里飘出来了？需要帮你系根防走失绳吗~',
  '明明在颤抖却不肯停？杂鱼的倔强用在这种地方~',
  '开始背诵圆周率分散注意力？第100位是‘笨蛋’哦~',
  '瞳孔都变成蚊香圈了啦~要召唤神龙实现愿望吗？',
  '最后关头打翻水杯？地板都比你有奉献精神呢~',
  '像被抽掉骨头的章鱼一样瘫着？建议改名‘软体动物酱’~',
  '说句‘我认输’就给你毛巾哦~~~~~~~~~~~~~~~~~~（用晾衣杆远远戳）',
  '呼吸节奏像漏气气球？噗嗤——飞走啦~',
  '说胡话的样子...是在和外星人通讯吗？',
  '手腕抽搐成发电报？摩斯密码写着‘菜’~',
  '后颈汗湿得像溺水？要帮你申请吉尼斯最弱纪录吗',
  '喉咙发出奇怪颤音？建议报名口技培训班啦',
  '蜷缩成虾米的姿势...今晚吃海鲜大餐吧~',
  '记住啦~杂鱼の每次失败\n都会变成姐姐手机里的\n羞耻音档哦~~~~~~~~~~~~~~~~~~~~~~~~~~（晃手机）\n要·不·要·再·试·试·看·呀~？',
  '哇哦~双手并用算作弊升级吗？',
  '手速和树懒同步？要给你喂桉树叶吗~'
]

export function randomMsg(count: number) :string{
  return msgs[getRandomInt(msgs.length)].replaceAll("{}",count + "")

}

function getRandomInt(max: number): number {
  return Math.floor(Math.random() * max); // [0, max)
}
